import LZString from "lz-string";

export const LZStringText = () => {
    const stringArray = [
        "馬鹿か！お前は！図体がデカいからって、パイロットが乗ったグランチャーと戦えるほどお前は良く出来ちゃいないんだ！親父達が何と言おうと、お前達は人間を乗せるためのスペースを用意して生まれたんだ！それは何故だかわかるか！？（ﾊﾟﾝｯ）ええっ！？お前達が、この地球の進化の歴史の中で学んだことだよな！人間の反射神経と判断力と感性、それに生殖だけは人間のものを利用するつもりだからな！こいつのコピーは面倒だもんなァ！しかし！力を行使することは自分たちのものにした！ヘッ……人間ってヤツは、力の使い方を知らないエゴイスティックな動物だからだろ？だからお前たちは、お前たちに必要な人間だけを摂取して、地球が育てた生物の生体エネルギーの全てを吸収して、銀河旅行をするつもりだ！……それがお前達だ！けどそういうお前達が、何故かグランチャーとブレンパワードという二つに分かれて生まれた。しかもオスとメスとの関係でもない、もっと根源的に、陰陽とか、プラスマイナスくらいはっきりと反発し合う習性を持ってる。何故だよ！（ﾊﾟﾝｯ）一つで完全無欠に、永遠であるものなど、この世の中には無い！だからこうやって！グチャグチャに生まれてきたんなら、オルファンだってそうだろう！自分の反対にあるものと戦って、探してるものがあるんだろう！ビー・プレートとか、もう一人のオルファンとかさぁ！オーガニックで有機的なものが一つのものであるわきゃないのに！貴様！……お前は！比瑪程度の女にそそのかされて……！！",
        "「待ってください。アムロさん。僕はあなたに聞いてるんです。シャア・アズナブル。何の用です」「君を迎えに来た、カミーユ・ビダン」「聞けませんね」「ではどうすればいいというのだ、カミーユ」「みんな死んだんだ。エマさんも、アポリー中尉も、ヘンケン艦長も。あの戦争で死んでいった人たちは、それで世界を変えられると思っていたから、死んでいったんです。みんな、あなたを信じたんだ。なのにあなたは僕らの前から消えて、ネオ・ジオンの総帥となって戻ってきた。それでやることが地球つぶしだっていうんですか！？そんなバカな話はない！あれは一体何のための戦いだったんです！？シャア・アズナブル！」「言いたいことはわかるが、今はそんな状況ではない」「あなたはいつもそうだ。いつもいつもそうやって自分一人違う場所にいようとする。」「誰かが人類の業を負わねばならんのだ」「言ったはずだカミーユ。戦士は生きている限り戦わねばならんのだ。生きている者がすべきことがある。それをすることが、死んだ者への手向けにもなるのだ」「……わかりましたよ。協力はします。でもね、僕は絶対あなたを許しませんよ。シャア・アズナブル。それを忘れないでいてもらいましょう」",
        "…我々は、一人の英雄を失った！しかし、これは敗北を意味するのか!?否、始まりなのだ！地球連邦に比べ、我がジオンの国力は三十分の一以下である。にもかかわらず、今日まで闘い抜いてこられたのは何故か!?諸君!!我がジオン公国の戦争目的が正義だからだ！これは諸君らが一番知っている。我々は地球を追われ宇宙移民者にさせられた！そして一握りのエリートが、宇宙にまで膨れ上がった地球連邦を支配して五十余年！宇宙に住む我々が、自由を要求して、何度、連邦に踏みにじられたか！ジオン公国の掲げる、「人類一人ひとりの自由の為の戦い」を、神が見捨てるわけはない！…私の弟、諸君らが愛してくれたガルマ・ザビは死んだ！何故だ!?戦いは、やや落ち着いた。諸君らはこの戦争を、対岸の火と見過ごしているのではないか!?ガルマは諸君らの甘い考えを自覚させる為に死んだ！諸君の、父も、兄も、子も、その連邦の無思慮な抵抗の前に死んでいったのだ！この悲しみも、怒りも、忘れてはならない！それをガルマは、死を以て我々に示してくれた！我々は、この怒りを結集し！連邦軍に叩き付けて、初めて真の勝利を得る事が出来る！…この勝利こそ、戦死者全てへの最大の慰めとなる！国民よ！悲しみを怒りに変えて！立てよ、国民よ!!我らジオン公国々民こそ、選ばれた民である事を忘れないで欲しいのだ！優良種たる我らこそ、人類を救い得るのである!!ジーク・ジオン！！",
        "「強納森！你這傢伙！是對亞諾瑪艦長ー！為了對你媽媽復仇，才成為Reclaimer的吧！？你媽媽、亞諾瑪艦長她，因為覺得有責任！跟Plate一起沉到了海底！消失了！已經沒有必要再把別人扯進來了吧！」「我已經不在乎那女人了！腦裡只有自己自尊的女人，誰會煩惱！」「你說謊！親子的感情不是那麼容易切斷的！」「呵哈哈！你就是沒有覺悟才會講出這種話！沒志氣的傢伙！算什麼男人！」「沒志氣！？沒有覺悟！？」「如果真有覺悟，連家人都殺得了！不是因為氣憤才做，即使沒覺得勃然大怒，只要有著正義的信念，和貫徹信念到底的堅持，就做得到！」「那是有原因的！…難言之隱！」「嘻哈哈！你就是沒有覺悟，才沒辦法弄沉Orphan！」「什，什麼？」「如果你真想弄沉Orphan，早在來的時候就裝好核彈或氫彈了吧！」「那種程度的玩意，弄不沉Orphan的！」「弄得了。只要你在裡頭引爆二、三十發枚核彈。連Orphan都會沉的。」「弄不了！」「勇啊，你這不是很奇怪嗎？那為什麼要跑到外頭，去喊著什麼『我要弄沉Orphan』呀？」「那是因為，還存在著像Microwave，或是B.Plate之類的可能性！」「你一開始就沒打算弄沉上頭有你雙親和姊姊的Orphan。這才是你真正的想法，為了在Novis.Noah上面生存，才會搭著Antibody戰鬥、裝模作樣！」「不對！！那些人就該跟著Orphan一起消失！！」「…你真的這麼想嗎？」「你想…說什麼！」「我啊，和昆西・以薩相愛著呢ー」「與我無關！」「稍微追求就得手了」「男女之間的事，沒什麼稀奇的！」「翠・伊佐未博士也是」「…你在說什麼？」「哎呀，還想說不過就是個老太婆。不過啊，嘖嘖，可真別有一番風情讓人感動啊」「唔嗚嗚！」「哈哈哈！憤怒吧！」「呃啊啊啊啊啊！！」「這種事一般是要覺得有趣的唷？你理解你為會生氣的理由吧？就是因為你沒法弄沉Orphan！」「說謊！這是強納森流的虛張聲勢！」「那就去問你媽媽吧。那充滿熱情的肉體…」「你這傢伙！！」「不好意思，我說得太過頭了」「但要跟你報告現狀，就是你老爸絲毫沒察覺妻子態度的轉變！而你是這樣的男女生下的小孩！」「真可憐哪，活著也很痛苦吧？讓我送你上路吧。別擔心，昆西我也會好好照顧的。我自認還挺有包容力的」「唔！別說了！」「哈哈哈哈！」「你作的事不管有什麼理由，都是狗畜生不如！魔鬼！卑賤至極！呃啊啊啊啊啊啊啊啊啊！」",
        "「那個…不是有個叫超級瑪莉歐的玩意嗎？」「啊？」從保健室醫生口中流出的，過於突兀的發言。超級瑪莉歐，我想就我的年代來說是無人不曉的，總之。「…我知道，遊戲對吧？」「沒錯，那個啊，是在玩什麼的？」「在玩什麼…就是打倒敵人、吃下香菇、潛入水管…」「…」「這，怎麼了嗎？」「你覺得那個男的對於自己正在做的事情…是怎麼想的呢？」「什麼意思？」大森となえ用著極緩慢的動作抹熄香煙。我再次抬頭望向她的表情，意外的相當認真。「真是瘋狂的故事啊…」「…？」「吃下幻覺香菇、身體變得巨大…」「哈？」「摘下花後就能噴出火燄…」「…這又怎麼了嗎？」「你知道大麻效力最強的部位在哪裡嗎？」「啊？不曉得」「是植物的最上層，也就是花朵」「啊…」「一個男人吃下撿到的香菇，覺得自己的身體似乎變得巨大」「啊…」「吃下花後能夠噴出火燄、除了自己之外，移動的事物全都是敵人…」我望著陷入小劇場的保健室醫生的舉動。我瞭解她所想講的東西了。真蠢。我笑著。「你想說瑪莉歐是藥物成癮者嗎？但是這種事情、太無聊了。這本來就只是童話一類的東西而已不是嗎」「…那、他的目的是什麼來著？」「拯救公主…吧？」「這樣子啊…」「就是所謂的騎士道精神。這是童話的基本形式。而且這不是件很偉大的事情嗎」大森となえ不發一語地伸向香煙盒，取出一根銜上，並點火。如同嘆息般呼出的煙…將我的視界染上一片白。「公主什麼的、真的存在嗎…」「啊哈哈，女孩需要白馬的騎士、男孩需要公主。但我們彼此都不是能再講這些東西的年紀了吧」「即使真的存在、又是否是真的被「怪物」所囚禁著呢…」となえ在這之後陷入了沉默。是因為談到了年紀而影響了他的心情嗎。若是這樣還真是不成熟。不過也不需要再陪她繼續聊這種無趣的話題了。瑪莉歐？而且瑪莉歐又怎麼了？再說…。啊、是這樣子啊…「となえ、瑪莉歐並不是在妄想瑪莉歐自身的事情對吧？」「欸？」「只是操作著瑪莉歐的人在妄想、瑪莉歐本身是沒有責任的」「不，所以說，是操作的人讓瑪莉歐…」「那麼又是誰在操作著的？」「咦？」「如果我是瑪莉歐的話，那一定有人在操作著我！」「你在說什麼…」「原來是這樣…」「…什麼？　怎麼了？」「是你對吧…」「咦？」「是你在操作我…」「等等…你作什麼…」我襲向了となえ。將她壓倒在地板上，壓著她的手問著。「是你在操作我對吧？是這樣對吧？我從之前開始就覺得很奇怪了！」「喂、冷靜點、喂！」「不是我…不是我的錯…」",
        "「我可是拚了死命才來到這裡，我來這裡不是為了看這些虛像的」「別生氣，我們來聊聊吧」「你到底想說什麼，別再拐彎了，講清楚！…難道你是在試探我嗎？為什麼，你到底想知道什麼！我沒有隱瞞任何事！」「為什麼你不從軍？」「因為我討厭他們的作法」「怎麼個討厭法？」「就像是捨棄垃圾般地，為了大我捨棄小我，在還沒確定手段的好壞之前，就已理所當然地做出決定」「500 年前，人類親手葬送了地球，國際聯盟因此以地球保護法為由，訂定了 ADAM 管理，為了促進人類的活性化，倖存的都市要在往後 500 年離開地球，而現在時間已到。你愛著由唯嗎？」「我喜歡她」「怎麼個喜歡法？」「我想和她永遠在一起，我想保護她，如果這能稱得上是愛的話，我愛著她，或者該說我正開始愛著他」「你現在想做什麼？」「常去的喫茶館、老面孔的機車行，我們的都市雖然只是在東京裡微不足道的小地方，這裡有著我們的伙伴，我想要一同在路上兜風，突然想見什麼人，留意電話的來電鈴聲、和老友互相鬥嘴、每天開心地活著」「對省吾你而言，大人是什麼？」「大人哪…小時候我非常憧憬『大人』這種稱呼，但現在看到那些所謂的大人，盡是做著只為滿足私欲的事情，欺騙、傷害甚至殺害他人，骯髒無比！我不想成為這樣的大人！真希望我碰見的能是兒時在電影和電視劇上所看到的大人」「那麼你就成為那種你所憧憬的大人吧」「我成為大人」「那麼或許就能改變這個城市或社會了」「伊芙，你到底想說什麼？」「ADAM 啟動了，但是否能夠返回地球，仍要由 ADAM 以我所傳過去的資料，判斷是否滿足回歸地球的條件，我是為了將不會再重複同樣過錯的人送回地球所設計的程式，我正在和 ADAM 交談。」「我們正往地球前進嗎」「是的，但是…」「ADAM 的判斷是？」「我也不知道」「為什麼？」「ADAM 仍然不發一語，我是沒有能力解除 ADAM 的」「沒關係的，伊芙，我們也不是值得活下來的人類，只是我認為能夠集齊眾人的力量來到這裡，並且遇見你，就很好了，謝謝你，伊芙」「謝謝你，省吾，請你到最後都不要放棄希望，我也會盡我所能幫助你的」「伊芙…」「仁者必勝的時代早已結束了，怎麼，不服氣嗎？矢作，站起來！」「你們大人總是這樣地貶視我們！別開玩笑了，因為強大就能為所欲為嗎！殺人如草芥、破壞一切，強大就是對的嗎！結果就是這副慘況啊！」「怎麼了，結束了嗎？」「你這樣的人揍了也是白費！」「那就是月球的防衛兵器，ADAM，月球本身就是一整顆武器，而那是異星人迪塞克的船艦」（♪秘密く．だ．さ．い）「我們也會變成那樣嗎」「沒錯，在還能活著的時候，照你喜歡的方式活吧。全新的世代嗎…」「你想尋死嗎」「這裡曾經是有生存價值的世界，但我所相信是正確的世界已經結束了。我真羨慕你哪。矢作省吾，這是我們最後一次見面了」「到最後還要耍帥」",
        "保健室 笑顔 給水塔 非道 快楽 我侭 近道 思春期 容赦 世界 気怠 猫 憧憬 休館日 淫猥 怪物 口腔空 同化 圧力 感覚 別離 痛覚眩暈 子供 霧散 狂騒 性交 言葉 男 少女 さよならを教えて 天使 焦燥 関係 粘着質 羽 形而上 幽霊 屋上 薄紫 規範 妄想 屍体 女 無表情 残酷 迷走 陰核 夜 過去 驟雨 矢 憂苦 母親 機会 意図的 破瓜 斜陽 無防備 脳髄 自意識 忽然 不可能 輪郭 彼岸 絞 無念 緋色毛根 蠢 足早 脆弱 緩急 阿頼耶識 経緯 媚薬 ●2000 CRAFTWORK All rights 小水 焦点 符合脚立 抵抗 拒否反応 維持 消毒 昼 必死 勃起 蜜金網 触発 混沌 丁寧 記憶 漆黒 満足感 激怒 抗議汗 着席 対峙 奥底 好奇心 警告 曖昧 払拭 偶像 人形正反対 柔肌 後悔 磁力線 重心 出血 不変 障害役割 邪気 艶 窓際 凄絶 土埃 居心地 脊髄 射精 変貌 御法神 緊張 視界 吐息 瓶 細胞 苦痛 五官 断続的 証明 断片 逆撫 肉孔 孤独感 屹立 階段 最高潮 情事 性的衝動 違和感 構成 堕落 動悸 胸元 教師 妖艶 複雑子宮口 崩壊 硬直 整理 辟易 肉壷 発端 膨張 一抹長髪 警報 放物線 双眸 一筋 凶裂 突然 舌先 狭間 廊下 透過速度 秘肉 空虚 朦朧 天国 躊躇 煙草 錯覚 悲鳴 唯心的 収縮 刺激 黄金分割 幻覚 同等 慟哭 饒舌 望郷 下半身 肉塊 Ｗ indows●95/98/Ｍ e Only 恍惚 否定 白墨 時間 淫液 支配 網膜 七不思議 悲鳴 存在弔 問客 赤面 標本 無言 潤滑油 芳醇 自分 一瞥 凝視 液体 過信 雑木林 命運 陰鬱 神秘学 充実 無力感 果実 紅潮 神聖視 震動 無数 裸 花壇 懐疑 判断 舞台裏 悲傷 不意 免罪符 次元 谷間 消極的 筆跡 肉塊 恍惚 否定 白墨 時間 淫液 支配 居心地 脊髄 射精 変貌御 法神 緊張 視界 吐息 瓶 細胞 苦痛 五官 緋色 毛根蠢 足早 脆弱 緩急 阿頼耶識 経緯 媚薬 最高潮 情事 性的衝動 違和感 構成 堕落 動悸 胸元 教師 妖艶 矢 憂苦 母親 機会意図的 破瓜 斜陽 無防備 脳髄 充実 無力感 果実 紅潮 神聖視 震動 無数 裸 花壇 懐疑 天使 焦燥 関係 粘着質 羽形而上 幽霊 屋上 薄紫 規範 妄想 屍体 女 無表情残酷 迷走",
        "會想求死，是因為滿是不安，會感到不安，是因為有所願，向世界，向自己所祈願的姿態顯得過於巨大，使得雙腳發抖，無法動彈，若是動起身來，就會無法保住自己的願望，你並不是想死，而是想以所願的姿態活著吧。願望是，非得要實現不可的嗎？",
        "紀子「矢吹你…不會覺得寂寞嗎？其他同齡的青年們帶著情人走遍高山藍海歌頌青春，你卻只是日覆一日關在滿是汗水、凡士林與松脂味的體育館裡，跳著跳繩、做柔軟體操、空揮練拳、敲擊沙包。提到有什麼比較亮麗鮮明的回憶，也只有處在眩目照明的，牢籠般的拳擊場中，散遍著香菸煙霧的鬥技場，丟出椅墊嘲諷的酒醉客人，像鬥雞與鬥犬般互毆至滿頭鮮血的生活…而且明明身高還有成長的可能性，卻要為了控制體重，不能盡情飲食，這實在太不堪、太悲慘了。要將這稱作青春，實在太昏暗了！」矢吹「我不太會說話…但我不是因為有所虧欠，或是欠下人情才在打著拳鬥的。因為我喜歡拳鬥，所以才走到了現在。也許這和小紀你講的歌頌青春有點不同，但我至今已在滿是鮮血的拳擊場上，嘗過了數次那種燃燒般的充實感…這和那種無法點燃、不完全燃燒的虛煙可不同了。雖然僅有短短的一瞬間，但它燃燒得可刺眼了。之後，只留下純白的灰燼…不留一絲未燃的餘燼…純白的灰。我在接觸拳鬥之前，從未嘗過這種充實感。你能瞭解嗎，小紀，我不是因為有所虧欠，或是欠下人情才在打著拳鬥的。因為我喜歡拳鬥，我喜歡這種發狂似地咬緊對方的充實感。」",
        "人們對電影的論述，實則只是對於電影的紀錄罷了，不僅無法釐清，也不能作為引用資料，在談論時也不可能當成參照文件提出，況且它不是與他人共享的體驗，而是個人性的經驗，這就是名為「觀看電影」的行為的真相。人是無法用話語表現自己所看見的東西的，「觀看的行為」和「使用話語去表現所看見的」兩者之間，實際上是沒有關聯的。觀看電影、觀賞完畢和談論所看的電影，以及談論觀看電影這回事，這些行為之間完全不存在任何共通點，不論是在一群人裡，或是同一個單獨個體，「同一部電影能夠提供給我們同樣的體驗」這種事情，只有在「電影是如同文章一樣的單一存在」這種幻想為前提時才有可能。那麼…能夠正確地談論電影的場所，如果真有這種地方存在，就只有正在放映的電影之中了",
        "說到虹色，也許很多人會聯想到的是「七色」，但在日本的傳統顏色裡，「虹色」指的是帶有些許黃色的，淡薄的紅色。以照片來說的話，虹色所指的並不是彩虹的本身，而是天空的顏色。為什麼這個顏色會被稱為虹色，說來有些不可思議。源由是「淡薄的紅色會因為光的反射，使得青色調或紫色調顯得更加強烈，呈現出各種不同的顏色，因而得名」。",
        "いつでも捜しているよ　どっかに君の姿を　カバンの中も 机の中も　探したけれど見つからないのに　それより僕と踊りませんか　朝が来るまで終わる事のないダンスを　踊ってない夜を知らない　踊ってない夜が気に入らない　君は知ってるかい？　踊らな死ぬ事を"
    ]

    const result: string[][] = [];
    stringArray.forEach(string => {
        const temp: string[] = []
        const raw = new TextEncoder().encode(string)
        const compressed = LZString.compress(string)
        const compressedUTF16 = LZString.compressToUTF16(string)
        const compressedBase64 = LZString.compressToBase64(string)
        const compressedURI = LZString.compressToEncodedURIComponent(string)
        temp.push(raw.length.toString())
        temp.push(compressed.length.toString())
        temp.push(compressedUTF16.length.toString())
        temp.push(compressedBase64.length.toString())
        temp.push(compressedURI.length.toString())

        temp.push(string)
        // temp.push(compressed)
        temp.push(compressedUTF16)
        // temp.push(compressedBase64)
        // temp.push(compressedURI)

        // const destring = LZString.decompress(compressed)
        // const destringUTF16 = LZString.decompressFromUTF16(compressedUTF16)
        // const destringBase64 = LZString.decompressFromBase64(compressedBase64)
        // const destringURI = LZString.decompressFromEncodedURIComponent(compressedURI)
        // temp.push(destring)
        // temp.push(destringUTF16)
        // temp.push(destringBase64)
        // temp.push(destringURI)

        // const destring_2 = LZString.decompress(string)
        // temp.push(destring_2)
        // try {
        //     const destringUTF16_2 = LZString.decompressFromUTF16(string)
        //     temp.push(destringUTF16_2)
        // } catch (e) {
        //     console.error(e)
        // }
        // const destringBase64_2 = LZString.decompressFromBase64(string)
        // temp.push(destringBase64_2)
        // const destringURI_2 = LZString.decompressFromEncodedURIComponent(string)
        // temp.push(destringURI_2)

        result.push(temp)
    })

    return (
        <table>
            <tbody>
                {result.map((r, i) =>
                    <tr key={i}>
                        <td>{i}</td>
                        {r.map((d, i2) =>
                            <td key={i2}>{d}</td>
                        )}
                    </tr>
                )}
            </tbody>
        </table>
    )
}